#include <stdio.h>
//문자열 배열은 자제로 주소값을 가져서 scanf로 입력을 받을 때 &을 붙이지 않는다.
// 문자열배열은 문자를 할당하고 남은 배열은 \0값 즉, null character가 들어감
// 입력하는 문자보다는 최소 +1 이상 크게 만들어야 함
// 초기화된 이후에는 새로운 문자열을 저장할 수 있으나, 문자열의 길이가 다를 수 있어서
//* 일반 변수처럼 대입 연산자를 사용하는 것은 불가능! (주소값을 가지고 있어서, 값을 넣으면 안됨)
int main()
{
    char str[80];
    //? str = "hi"; // 이런식으로 바로 대입하는것이 안됨
    // 아래처럼 대신 문자열 상수를 직접 넣어서 하는 것은 가능
    char str1[80] = "hi";

    printf("%s\n", str1);
    //* 문자열 전용 함수 gets("문자열"), puts("문자열")
    printf("문자열 입력하세요: ");
    gets(str); //엔터치기 전까지 입력을 받음.(빈칸 포함 문자열) 
    //scanf는 문자만 받을 수 있고 띄어쓰기를 하면 입력이 완료로 간주

    puts("입력된 문자열: ");
    puts(str);

    
    return 0;
}
//