// 배열 포인터 
// 배열을 포인터로 받으면, 여기서 포인터도 배열 형태로 받을 때 예: int (*pointer)[3]
// 즉, 배열을 포인터의 배열로 받으면 배열 처럼 사용 가능해짐 (이것을 배열 포인터라고 함)
#include <stdio.h>
void print_ary(int (*)[4]); //(괄호에는 배열포인터의 변수명 생략 가능)

int main () {
    int ary[3][4] = {
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12}
    };
    print_ary(ary);  //배열을 넘김 (&없음)
    return 0;
}


void print_ary(int (*pa)[4]) { //()괄호로 감싼 배열 포인터를 받는다. [4]는 col의 개수 // 1차원 배열의 4개짜리 int형을 가리킴
    int i, j;

    for (i=0; i < 3; i++) {
        for(j=0; j < 4; j++) {
            printf("%5d", pa[i][j]);  //** 배열 포인터는 2차원 배열 처럼 사용
            /* //*433 페이지 참고
                ptr + 0 == arr
                ptr + 1 == arr[1]
                *(ptr + 1) == arr[1]  //역 참조할 때 사용법
                *(*(ptr + 0) + 1) == arr[0][1]  //역 참조할 때 사용법 ()괄호 두번 감싸기
                *(ptr + 1) + 2 == arr[2]  // arr[1]에서 +2 를 한 값  //2차원 배열에서는 row의 주소값
                (ptr + 1) +2 == ptr +3 //  위의 것과 다름
            */
        }
        printf("\n");
    }
    printf("%5d\n", *(pa + 0) +2); //주소값 // 정확하게 출력 못함
    printf("%5d\n", (pa + 0) +2); //주소값
    printf("%5d", *(*(pa + 1) +1)); //주소값 //? 2차원 배열이므로 2번 감싸야 함
    printf("%5d\n", *(*(pa + 2) +3)); //포인터로 받은게 배열인데 2차원 배열이므로 정확하게 출력하려면 괄호로 두번 감싸기
    printf("%5d\n", pa[0][3]); //** 어쩌면 배열포인터의 핵심은 포인터는 배열을 받았으므로 포인터도 배열처럼 사용하면 된다 인듯!
    // 그냥 쉽게 배열처럼 쓰자;; 

}