# 2차원 리스트
#a = [[10, 20], [30, 40], [50, 60]]
# 여러줄로도 표현이 가능
a = [[10, 20],
     [30, 40],
     [50, 60]]
'''
#for문으로 반복해서 리스트 출력하기
for x, y in a:  # 리스트의 1차원 배열에서 요소를 꺼냄(2차원)
    print(x, y)
'''

'''
# 중복 for문으로 리스트 출력
for i in a:  # a리스트에서 1차원 배열 꺼내옴
    for j in i:  # 1차원 배열에서 2차원 배열 for문 돌림
        print(j, end=' ')  # j는 2차원 배열 출력 (2개)
    print() #줄바꿈
'''

'''
#len()함수로 접근
for i in range(len(a)):  # 1차원배열의 개수 반환: 3만큼 
    for j in range(len(a[i])):  # 2차원 배열의 개수 반환: 2만큼
        print(a[i][j], end=' ')
    print()  # 줄바꿈
'''


# while문으로 인덱스 접근
i = 0
while i < len(a):  # 1차원 배열의 개수
    x, y = a[i]  # 1차원에 들어가 있는 2차원 x, y변수에 할당
    print(x, y)
    i += 1

