#include <stdio.h>
int main()
{
    int numArr[3][4] = {
        {1, 2, 3, 4},
        {11, 22, 33, 44},
        {111, 222, 333, 444}};
    // 에러 int **numptr = numArr;  // 이렇게 하면 int형 포인터와 int 배열과 imcompatible 된다고 나옴
    int(*numPtr)[4] = numArr; //포인터 선언 시 (* 포인터변수)로 묶어 준다 // 배열을 가리킴 배열 포인터
    //배열자체가 주소가 되므로 &는 필요가 없음

    /* 
    //괄호가 없을 시
    int num1, num2, num3, num4;
    int *ptr[4] = { &num1, &num2, &num3, &num4};  //뒤의 주소값을 주는 것이 배열은 아닌 각자 따로의 변수들
    이렇게  포인터에 괄호를 빼면 int형 포인터를 4개를 담을 수 있는 배열이란 소리 (포인터를 여러개 담는 4개의 포인터 배열)
    하지만 괄호가 있다면,
    배열을 가리키는 배열 포인터가 됨
    위의 경우 같이 int (*numPtr)[4] 처럼 정의 하면
    4개의 배열에 각각 numPtr의 배열의 첫번째[]의 (1차원의) 배열 주소를 가리킴
*/

    printf("%d\n", *numPtr); // 역참조 하면 세로 첫 번째 주소가 나옴 [0][0]
    printf("%d\n", *(numPtr + 0) + 1);

    printf("%d\n", numPtr[1][2]); // 2차원 배열 포인터는 인덱스로 접근 가능
}