''' 퀴즈
표준 입력으로 국어, 영어, 수학, 과학 점수가 입력됩니다. 
여기서 네 과목의 평균 점수가 80점 이상일 때 합격이라고 정했습니다. 
평균 점수에 따라 '합격', '불합격'을 출력하는 프로그램을 만드세요
(input에서 안내 문자열은 출력하지 않아야 합니다). 
단, 점수는 0점부터 100점까지만 입력받을 수 있으며 
범위를 벗어났다면 '잘못된 점수'를 출력하고 합격, 
불합격 여부는 출력하지 않아야 합니다.
'''
kor, eng, math, sci = map(int,(input().split()))

if ((kor >= 0 and kor <= 100) and (eng >= 0  and eng <= 100) and (math >= 0 and math <= 100) and (sci >= 0 and sci <= 100)):
#? and 조건으로 해야지 하나만 만족하고 원하는 결과갑이 안나오게 될 수 있음(or)에 주의
#? or 조건으로 하려면 조건이 false가 될 것으로 예상하고 0보다 작거나 100보다 크거나 이런식으로 가야할 듯
    if ((kor + eng + math + sci)/4 >= 80):
        print('합격')
    else:
        print('불합격')
else:
    print('잘못된 점수')
